Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja4/mimmi-s.htm.tmx
Source language: sme
Languages: nob

source: Son lei dalle juo leamaš doppe moaddelogi jagi , son dovddai báikkálaš diliid ja dovddai bearrašiid .
nob: Hun hadde da allerede vært der i flere tiår , hun kjente de lokale forholda og kjente familiene .

source: Son lei maiddái leamaš mu eatni oahpaheaddji .
nob: Hun hadde også vært lærer for min mor .

source: Anna lei garra nisson .
nob: Anna var ei streng dame .

source: Jus oahppit eai meannudan juste nu go galge , de fertejedje heahpatčihkii .
nob: Om ikke elevene oppførte seg helt som de skulle , var det i skammekroken .

source: Muittán muhtin nieidda gii sáddejuvvui heahpatčihkii , son balai nu ahte cissai buvssaide . Láhtti lei vitnjut ja buohkat oidne ahte golggai láhtti mielde eret čiegas .
nob: Jeg husker at ei jente som blei sendt i skammekroken blei så redd at hun tissa seg ut , Golvet var skeivt og alle kunne se at det rant etter golvet ut fra kroken .

source: Anna sáhtii loktet mánáid beljiid duohken .
nob: Ho kunne ta ungene og løfte dem fra golvet etter ørene .

source: Eará ráŋggáštus lei skáhppii giddejuvvot .
nob: Ei annen straff var å bli stengt inne i skapet .

source: Oahppi fertii čohkkat roaŋkut vuolimusas girjeskábes ja Anna lássii uvssa .
nob: Eleven måtte sitte tvikroket nederst i bokskapet og Anna låste døra .

source: « Frøken » Anderssen ii lean háleštanmuttus skuvlajođiheddjiin .
nob: Frøken Anderssen var ikke på talefot med skolestyreren .

source: Soai eaba oba ságastallan , muhto reivvestattaiga , ja mii mánát fertiimet mannat feaskára rastá reivviid addit .
nob: De snakka rett og slett ikke til hverandre , men skreiv brev , og vi ungene måtte gå over gangen og levere breva .

source: Juohke iđit ferteje muhtin internáhta nieiddat mannat Anna ruoktot su viežžat skuvlii , ja go skuvlabeaivi lei nohkan , de ferteje čuovvut su ruoktot fas .
nob: Hver morgen måtte noen av jentene på internatet gå hjem til henne og hente henne til skolen , og når skoledagen var over , måtte de følge henne hjem igjen .

source: Buohkat dihte ahte Anna Anderssen lei sápmelaš Deanus , muhto dan birra ii galgan hupmat jitnosit .
nob: Alle visste at Anna Anderssen var same fra Tana , men det var noe det ikke skulle snakkes høyt om .

source: Oktii lei muhtin máinnašan su « finn » an .
nob: En gang var det noen som hadde omtalt henne som « finn » .

source: Dan son namuhii luohkás ja de son logai geain min luohkás lei sámi duogáš .
nob: Det tok hun opp i klassen og da ramsa hun opp hvor mange i klassen som hadde samisk bakgrunn .

source: Muhto son deattuhii dušše fal áhčiid duogáža .
nob: Men hun la bare vekt på fedrenes bakgrunn .

source: Mu birra logai ahte Mimmi ii leat sápmelaš , go su áhčči bođii Ánddás .
nob: Om meg sa hun at Mimmi er ikke same , for far hennes kom fra Andøya .

source: Dalle vuosttaldedje eará mánát , go sii han dovde mu eatni soga .
nob: Da protesterte de andre ungene , de kjente jo til slekta til mor mi .

source: Ohppiide geat ledje čeahpit skuvllas , Anna gal sáhtii leat buorre oahpaheaddji .
nob: For elever som var flinke på skolen kunne nok Anna være en god lærer .

source: Muhto daidda geaidda lei lossat oahppat , ii lean olu veahkki oažžumis , sii fuonášuvvoje , ja erenoamáš váivi lei mánáide geain lei sámi duogáš .
nob: Men for dem som hadde tungt for å lære var det lite hjelp å få , de blei regna som stakkarslige , og særlig gikk det utover elever med samisk bakgrunn .

source: Ii dárbbašan eahpidit ahte Annai lei dážavuohta mas lei árvu .
nob: Det var ingen tvil om at for Anna var det det norske som hadde status .

source: ( Gova luoikan Ragnhild Sandøy )
nob: ( Foto utlånt av Ragnhild Sandøy .

source: Mis ledje oalle bistevaš oahpaheaddjit , dušše fal golbma luohkkájođiheaddji ovcci jagis .
nob: Vi hadde ganske stabile lærere , bare 3 klassestyrere på 9 år .

source: Nuoraidskuvllas ožžon Asbjørn Anderssen luohkkájođiheaddjin , son lei Anna vielja , Pavel Anderssena , bárdni .
nob: I ungdomsskolen fikk jeg Asbjørn Anderssen som klassestyrer , han var sønn av Pavel Anderssen , bror til Anna .

source: Dalle go álgen nuoraidskuvlii , mun gullen Sállannuoris nuppi jahkodahkii , mii váccii 9-jagaš nuoraidskuvlla .
nob: Da jeg begynte i ungdomsskolen i 1963 hørte jeg til andre kullet som fikk 9-årig ungdomsskole i Sørøysund .

source: Dalle ledje kursaplánat nuoraidskuvllas , ja mii bággejuvvojedje válljet plána 1 , 2 dahje 3 dárogielas , matematihkas ja eŋgelasgielas .
nob: Dengang var det kursplaner på ungdomsskolen , vi blei tvunget til å velge mellom plan 1 , 2 eller 3 i norsk , matematikk og engelsk .

source: Ráđđeaddi áiggui mu válljet 3. dási plána , muhto mun lohken ahte háliidin 2. dási plána , dan dihte go háliidin oahppat ovttas iežan ustibiiguin .
nob: Rådgiveren ville sette meg på plan 3 , men jeg sa jeg ville ha kursplan 2 , fordi jeg ville lære sammen med vennene mine .

source: Dat lei mu bealis muhtin lágan miellačájáhus dan vuogádaga vuostá mii háddjii min .
nob: Det var en slags demonstrasjon fra mi side mot dette systemet som splitta oss .

source: Go skuvlaloahppa lahkonišgođii de mii dieđusge illudeimmet geargat .
nob: Da skolen nærma seg slutten , så vi jo fram til at den skulle være over .

source: Muhto gávpogii fárret ja áibbas okto čohkkát hybelis , dat han lei vearrát go internáhtas orrut .
nob: Men å flytte på hybel i byen og sitte der helt aleine – det var faktisk verre .

source: Dattetge lei nu ahte go álggiimet joatkkaskuvlii , de mii leimmet nu guhkás gáidan ruovttubirrasis ahte mis ii lean šat miella mannat ruoktot vahkkoloahpas .
nob: Likevel var det slik at når vi begynte på videregående hadde vi blitt fjerna så langt fra hjemmemiljøet at vi ikke lenger hadde lyst å dra hjem i helgene .

source: Go jurddašan dan skuvlla mii mis lei , de gal lea ártet ahte šattaimet olmmožin .
nob: Når jeg tenker tilbake på den skolen vi hadde , er det i grunnen rart at det blei folk av oss .

source: Muhto ii mannan seamma bures buohkaiguin , ja skuvla ferte váldit stuora oasi sivas ahte máŋggas maŋŋil leat ožžon psykalaš váttisvuođaid ja alkoholaváttisvuođaid .
nob: Men det var ikke alle det gikk like bra med , og skolen må nok ta mye av skylda for at mange seinere har fått psykiske problemer og alkoholproblemer .

source: Min máhttu ii lean man ge veara
nob: Vår kunnskap var negativ

source: – Skuvllas Lávželuovttas ii lean goassege sáhka báikkálaš dilis ja báikkálaš historjjás .
nob: – På skolen i Rypefjord var det aldri snakk om lokale forhold og lokalhistorie .

source: Doppe eat goassege oahppan čevllohallat min iežamet vuođus , baicce vásiheimmet ahte duogáš mii mis lei , máhttu mii mis lei meahci ja birgema birra , lei heittot , juoga maid mii galggaimet heahpanit , juoga maid galggaimet vajálduhttit .
nob: Der lærte vi aldri å være stolt av vårt eget ståsted , tvert om opplevde vi at den bakgrunnen vi hadde og den kunnskapen vi hadde om naturen og livberging var noe mindreverdig , noe vi skulle skamme oss over og glømme .

source: Jurddašan man ollu min máttarmáttut máhtte maid ii oktage šat máhte dál , dušše dan dihte go dát máhttu ii adnojuvvon man ge vearan ja danin ii fievrriduvvon viidáseappot .
nob: Jeg tenker på alt våre forfedre og formødre kunne , som ingen kan i dag , rett og slett fordi denne kunnskapen blei definert som negativ og derfor ikke ført videre .

source: Eanaš oahpaheaddjit bohte eará guovlluin , muhto muittán ahte mis lei muhtin oahpaheaddji gii lei Sievjjus eret .
nob: De fleste lærerne kom jo utafra , men jeg husker at vi hadde en lærer som var fra Seiland .

source: Son oahpahii mu , muhto ferten lohkat ahte son ii lean ollu báidnon dan árvovuđđui mainna mii šattaimet bajás .
nob: Han underviste meg , men jeg må si at han ikke var mye prega av det verdigrunnlaget vi vokste opp med .

source: Son lei čeahppi lohkanmeari-áššiin , muhto ii namuhan báikkálaš diliid .
nob: Han var flink i pensum , men gjorde ingen ting for å ta opp lokale forhold .

source: Dalle go son lei leamaš min luhtte ja ságastallan áhkuin , de áhkku celkkii ahte oahppu lei vahágahttán su .
nob: Da han hadde vært og snakka med bestemor slo ho ganske enkelt fast at han hadde tatt skade av å utdanne seg .

source: Buot oahpaheddjiid gaskkas , geaid lean deaivan oahppin , eadnin ja báikkálaš politihkkariin , lea dušše okta gean lean dovdan ahte ii čuvvon visot mii bođii guovddáš eiseválddiin .
nob: Av alle lærere jeg har vært borti som elev , som mor og som lokalpolitiker er det bare en som jeg følte at ikke var helt med på alt som blei forkynt fra sentralt hold .

source: Dat lei Bertil Johansen Fjordtunas .
nob: Det var Bertil Johansen på Fjordtun .

source: Dovden ahte son speadjalasttii sámi árvvuid .
nob: Han følte jeg at gjenspeilte samiske verdier .

source: Sámegiella jávká
nob: Samisken blir borte

source: – Mánnávuođa rájes ledjen hárjánan gullat sámegiela , vaikko mii mánát humaimet dušše dárogiela .
nob: – Fra barndommen var jeg vant til å høre samisk , sjøl om vi ungene bare snakka norsk .

source: Muittán oktii 12–13-jahkásažžan ahte geahččalin dadjat juoidá sámegillii muhtin boares divdui .
nob: Jeg husker en gang i 12–13-års-alderen at jeg forsøkte å si noe på samisk til en eldre mann .

source: Muhto ii sáhte leat šaddan áibbas riekta , go son boagustii mu nu sakka ahte mearridin ahte dan in goassege áigon geahččalit šat .
nob: Men det kan visst ikke ha blitt helt rett , for han lo sånn av meg , at jeg bestemte meg for at det prøver jeg aldri mer på .

source: Muhto ipmirdan measta visot mii daddjo sámegillii .
nob: Men jeg forstår det aller meste på samisk .

source: Mu áhku ja ádjá buolvvas hupme eatnašat Sievjjus sámegiela .
nob: I generasjonen til mine besteforeldre snakka de fleste samisk på Seiland .

source: Váhnenbuolvvas jávkkai sámegiela Njižževuonas , muhto bisttii veaháš guhkit Muotkevuonas .
nob: I foreldregenerasjonen min blei samisken borte i Hønseby , men holdt seg noe lenger i Eidvågen .

source: Muhto mu ahkásaččaid gaskkas leat dušše moattis geat máhttet sámástit , ja máŋggas geat eai ipmir ge .
nob: Men blant dem som er på min alder er det svært få som kan snakke samisk og mange som heller ikke forstår .

source: Sin gaskkas geat dál leat vuollil 50 jagi lea giella measta áibbas jávkan .
nob: Blant dem som i dag er under 50 år er språket stort sett helt borte .

source: Gielain jávkkai maiddái buorre muddui sámi identitehtta .
nob: Med språket forsvant også i stor grad den samiske identiteten .

source: Máŋggas eai háliidan dovddastit ge ahte sis livččii sámi duogáš , dat lei dakkár man birra ii galgan hupmat .
nob: Mange ville ikke være ved den samiske bakgrunnen sin og det var ikke populært å snakke om det .

source: Viimmat iežamet skuvla
nob: Endelig egen skole

source: Vaikko 1957/58 skuvlastreaikka boađus lei ahte váhnemat vuoittahalle ja ráŋggáštuvvojedje , de sii eai vuollánan .
nob: Sjøl om streiken for egen skole i 1957/58 endte med nederlag og straff for foreldra , ga befolkninga ikke opp kampen .

source: Gáibádus ceggejuvvui máŋgii ja Mimmi beroštupmi skuvlii lei okta sivva dasa ahte son 1979:s válljejuvvui Sállannuori suohkanstivrii .
nob: Kravet blei reist igjen og igjen og Mimmis engasjement for skole var en av årsakene til at hun blei valgt inn i Sørøysund kommunestyre i 1979 .

source: – Doppe lei dalle ain stuora vuosteháhku dan jurdagii ahte galggašeimmet hukset skuvlla deike .
nob: – Der var da fortsatt stor motstand mot at vi skulle få egen skole .

source: Dat biddjojuvvui Lávželuovtta industriijaguovllu ja ásodatbáikki vuostá .
nob: Det blei satt opp mot bygging av industriområde og boligfelt i Rypefjord .

source: Ágga lei dakkár , ahte álggos fertiimet oažžut industriija guovddážii nu ahte suohkan oččošii eambbo vearroruđaid , dan maŋŋá soaitá bázášii ruhtabinná doaresbealbáikkiide .
nob: Først måtte vi få industri i sentrum slik at kommunen fikk skatteinntekter , deretter kunne det kanskje bli råd til litt til utkantene , var argumentet .

source: Loahpas suohkan mieđihii hukset skuvlla davit Sivjui .
nob: Til sist førte kampen fram og kommunen gikk med på at det skulle bygges en egen skole på nordre Seiland .

source: Muhto gosa ?
nob: Men hvor ?

source: Ledje guokte gili , Njižževuotna ja Muotkevuotna , 15 km daid gaskkas , ja goappašat háliidedje skuvlla .
nob: Det var hovedsakelig to bygder , Hønseby og Eidvågen med 15 km mellom , og begge ville ha skolen .

source: Dolin lei skuvla leamaš njárggas vuonaid gaskkas , muhto doppe eai lean eará viesut , ii ge lean vuogaš viessohuksenbáiki .
nob: I gamle dager hadde den ligget på neset mellom fjordene , men der var ingen hus i nærheten og ingen egna tomt .

source: Giliid gaskasaš riidu bisttii moadde jagi .
nob: Det tok noen år med krangel mellom bygdene .

source: Go huksejuvvui geaidnu Njižževuona ja Muotkevuona gaskii feargaoktavuođain Fálái , lei ášši čoavdinláhkái .
nob: Viktig for løsninga var at det blei bygd vei mellom Hønseby og Eidvågen og videre fergesamband over til Kvaløya .

source: Geainnu ledje giliolbmot gáibidan 1919 rájes , dat gárvvistuvvui 1984:s .
nob: Veien hadde bygdefolket kjempa for siden 1919 , den blei ferdig i 1984 .

source: Dán láhkái šattai beaivválaš skuvlasáhttu vejolažžan .
nob: Dermed blei det mulig med daglig skoleskyss .

source: Loahpas skuvla huksejuvvui Njižževutnii .
nob: Det endte med at skolen blei plassert i Hønseby .

source: Dat nammaduvvui Daltun skuvlan ja rahppui 1985:s .
nob: Den fikk navnet Daltun skole og blei innvia i 1985 .

source: Lea leamaš gitta 26 oahppi , muhto 2006:s eai lean go 14 .
nob: På det meste har det vært 26 elever , i skoleåret 2009/10 var elevtallet nede i 7 .

source: Muotkevuotna gehččon Roavis .
nob: Eidvågen sett fra Eidvågeidet .

source: ( Govva : Svein Lund )
nob: ( Foto : Svein Lund )

source: Njižževuotna Daltun skuvllain duogážis .
nob: Hønseby med Daltun skole i bakgrunnen .

source: Moadde jagi maŋŋil go Daltun skole lei doaibmagoahtán , lágiidii skuvla fáddávahkku « Máttarváhnemiid Sievju » .
nob: Få år etter at Daltun skole var starta arrangerte skolen ei temauke om « Seiland på våre oldeforeldres tid » .

source: Lei hui stuora beroštupmi olbmuid gaskkas searvat dasa .
nob: Det var et veldig engasjement blant folk for å bidra til dette .

source: Buohkat ohce boares diŋggaid ja muitaledje dološ áiggis .
nob: Alle leita fram gamle ting og fortalte fra gamle dager .

source: Dalle go dát galggai ovdanbuktojuvvot lei giliviessu spagga dievva .
nob: Da dette skulle presenteres på grendehuset var det stappfullt av folk .

source: Eai fal dušše váhnemat , áhkut ja ádját boahtán , muhto maiddái olbmot geain eai lean mánát eai ge mánáidmánát skuvllas .
nob: Ikke bare foreldre og besteforeldre stilte opp men også folk som ikke hadde barn eller barnebarn i skolen .

source: Máŋggas bohte guhkkin .
nob: Mange kom langveis fra .

source: Dát čájeha man stuorra dárbu olbmuin lea oahppat mii lea min iežamet , dát lea máhttu maid skuvla ja stuoraservodat leat rivven mis .
nob: Dette viser et sug etter å få lære hva som er vårt eget , dette er en kunnskap som skolen og storsamfunnet har tatt fra oss .

source: Dan maŋŋá lea skuvlla čanus báikkálaš servodahkii dađe bahábut leamaš nu ja ná .
nob: Siden har det dessverre vært så som så med skolens tilknytning til lokalsamfunnet .

source: Lea dušše okta oahpaheaddji gii boahtá dán guovllus , ja oahpaheaddjit dihtet unnán báikkálaš kultuvrra ja historjjá birra .
nob: Det er bare en lærer som er fra distriktet , og de kjenner lite til lokal kultur og historie .

source: Go sii galget gieđahallat fáttáid mat gusket sámiide , de sii eai nagot fokuseret .
nob: Når de skal ta opp emner som gjelder samer , klarer de ikke å få rett fokus .

source: Ovdamearkka dihtii galggai leat sámi beaivi skuvllas , dalle lei visot Guovdageainnu ja boazodoalu birra .
nob: For eksempel skulle de ha samisk dag på skolen , da dreide alt seg om Kautokeino og reindrifta .

source: Jerren rektoris manne sii galget guossohit bohccobierggu sámi beaivvis .
nob: Jeg spurte rektor hvorfor de skulle servere reinkjøtt på samisk dag .

source: Manne eai sáhttán vuoššat guoli .
nob: Hvorfor kunne de ikke ha fisk ?

source: Ii fal , dat ii livččii sámi , vástidii .
nob: Nei , det kunne de ikke for det var ikke samisk .

source: Ja dát dáhpáhuvvá skuvllas gos eanaš ohppiin lea mearrasámi duogáš .
nob: Og det skjer i en skole der de fleste elevene har sjøsamisk bakgrunn .

source: Ii álki leat sápmelažžan Hámmárfeasttas
nob: Ikke lett å være same i Hammerfest

source: – Ii leat leamaš álki leat almmolaš sápmelažžan Hámmárfeastta gávpogis , ii ge ovddeš Sállannuori suohkanis .
nob: – Det har ikke vært så lett å stå fram som same verken i Hammerfest by eller i distriktet rundt , den tidligere Sørøysund kommune .

source: Dalle go sámi jienastuslohku álggahuvvui , dieđihin dakkaviđe dohko , ja de jerren áhkus maid son oaivvildii .
nob: Da samemanntallet blei oppretta , meldte jeg meg straks inn der og så spurte jeg hva bestemor mente .

source: Son logai ahte in galgan jáhkkit ahte lei álki rievdadit dan maid mii leimmet máŋggaid buolvvaid čađa oahppan , ahte sámevuohta lei unnitárvvosaš , mas galggašeimmet geahččalit eret beassat .
nob: Ho sa da at jeg måtte ikke tru at det var bare å snu det vi var innpoda med gjennom mange generasjoner , at det samiske var noe mindreverdig som vi måtte forsøke å komme bort fra .

source: Go dieđihin sámi jienastuslohkui , láhttejedje mu fuolkkit nu láhkái .
nob: Da jeg meldte meg inn i samemanntallet var det mange slags reaksjoner fra slektningene mine .

source: Muhtimat jerre : Sáhtášin go mun maid dieđihit dohko ?
nob: Noen kom og spurte : Kunne jeg også meldt meg inn der ?

source: Earát suhtte munnje go ledjen almmostahttán sin sápmelažžan , ja muhtimat fas hirpmástuvve go eai diehtán ahte sis lei makkárge sámi duogáš , go dan eai lean váhnemeaset goassege muitalan .
nob: Andre blei sinte fordi jeg hadde blottstilt dem som samer , mens noen fikk sjokk , for de visste ikke at de hadde noen samisk bakgrunn , foreldrene hadde aldri fortalt det .

source: Sáhtášin muitalit máŋga fearána das maid sáhttá vásihit go almmolaččat cealká iežas sápmelažžan , sáhtán moadde ovdamearkka namahit .
nob: Jeg kunne fortalt mange historier om hva man blir møtt med når man står fram som same her , men jeg skal ta et lite utvalg .

source: Jáhkovuotnalaš Ole Johan Nikodemussen lea čállán Fálesnuori , Porsáŋggu ja Muosáid sohkahistorjjá .
nob: Ole Johan Nikodemussen i Kokelv har skrevet slektshistorie fra Kvalsund , Porsanger og Måsøy .

source: Son háliidii maiddái čállit Sállannuori birra , muhto dalle oaččui čielga dieđu ahte dan ii dárbbašan ba smiehttat ge .
nob: Han ønska også å skrive om Sørøysund , men da fikk han klar beskjed om å holde fingrene av fatet .

source: Dáppe olbmot eai háliidan makkárge sohkahistorjjá mii sáhtášii almmustahttit man olusiin sis lei sámi duogáš .
nob: I Sørøysund ville man ikke vite av noe slektshistorie som kunne avsløre hvor mange som hadde samisk bakgrunn .

source: Dáppe lea olmmái gii áinnas muitala ruoššaid ja dánskalaččaid birra , geat bohte deike , ja geat ledje su máttut .
nob: Her på Seiland er en kar som gjerne forteller om russerne og danskene som kom hit og som han stammer fra .

source: Muhto jus mii jearrat sus geaiguin dát sisafárrejeaddjit náitaledje , de son hárdašuvvá albmaláhkái .
nob: Men når vi spør han hvem disse innflytterne gifta seg med , da blir han alvorlig fornærma .

source: Sii eai galgga namuhuvvot .
nob: De skal ikke nevnes .

source: Nils Andersen Muotkevuonas lei gávpejas ja lei Sievjju-gávtti maŋimuš geavaheddjiid gaskkas .
nob: Nils Andersen i Eidvågen var handelsmann og en av de aller siste som brukte sørøysundkofta offentlig .

source: Dás sárdnida Gonagassii Troandimis 1945 .
nob: Her taler han til Kongen i Trondheim 1945 .

source: ( Gova luoikan Andre Larsen )
nob: ( Foto utlånt av Andre Larsen )

source: Mimmi Bæivi čájeha Sievjogávttis .
nob: Mimmi Bæivi viser fram Seilandskofta si .

source: ( Govva : Basia Głowacka )
nob: ( Foto : Basia Głowacka )

source: Iežamet gákti
nob: Egen kofte

source: – Dáppe Davit Sievjjus lea mis iežamet sámegákti .
nob: – Her på Nordre Seiland har vi ei egen samekofte .

source: Dat lei dábálaččat anus 1900-logu álggu rádjái , muhtimat geavahedje gávtti 2. máilmmisoađi rádjái , dušše moattis soađi maŋŋá .
nob: Den var i vanlig bruk til tidlig på 1900-tallet , noen brukte kofta fram til 2. verdenskrigen , bare ganske få i åra etterpå .

source: Mu áhkku goarui gávttiid , muhto son goarui eanaš Guovdageainnu-gávttiid .
nob: Bestemor mi sydde kofter , men da gikk det mest på Kautokeino-kofter .

source: Su maŋŋá ii lean oktage dáppe gii máhtii gávttiid goarrut , nu ahte go mun háhken Sievjju-gávtti alccesan , de fertejin dan goaruhit Guovdageainnus !
nob: Men etter henne var det ingen her som kunne sy kofter , så da jeg skaffa meg Seilands-kofte , måtte jeg få den sydd i Kautokeino !

source: Muhto eai leat máŋggas geat dovdet dán gávtti ja muhtimat eai leat dohkkehan ge ahte gávdno sámegákti dáppe .
nob: Men det er ikke mange som kjenner denne kofta og noen har ikke engang godtatt at det finnes ei samekofte herfra .

source: Dalle go mun vuosttaš háve ledjen gávttehassan Hámmárfeasttas , lei muhtin Sállannisu gii jearai mus makkár gákti mus lei .
nob: Da jeg hadde kofta mi på meg første gang i Hammerfest var det ei dame fra Sørøya som spurte hva slags kofte jeg hadde .

source: Go muitalin ahte dat lei Sievju- / Hámmárfeasta-gákti de son suhtai ja logai : – Ale gielis , dakkár ii gávdno .
nob: Da jeg fortalte at det var Seiland / Hammerfest-kofte blei ho sint og sa : – Ikke lyg , noe slikt finnes ikke .

source: Muhto mearrasámiide ii leat leamaš váttis dohkkehuvvot sápmelažžan dušše iežamet birrasis .
nob: Men sjøsamene har ikke bare hatt vanskelig for å bli anerkjent i sitt eget miljø .

source: Maiddái sámegielat sámiid gaskkas Sis-Finnmárkkus lea leamaš váttis mearrasámiide dohkkehuvvot sápmelažžan .
nob: Også blant de samisktalende samene i Indre Finnmark har de hatt vanskelig for å bli anerkjent som samer .

source: – Dalle go mun válljejuvvojin / bessen Sámediggái ledje doppe guovddáš olbmot geat jerre mus maid mun doppe .
nob: – Da jeg kom på Sametinget var det framtredende personer som spurte meg hva jeg gjorde der .

source: Dalle fertejin vástidit ahte ledjen válljejuvvon seamma vuođus go eará áirasat ge , ja muđui ii leat ii oktage sámediggeáirras geas lea eambbo sámi goargu go mus !
nob: Da måtte jeg svare at jeg var valgt inn på samme grunnlag som de andre representantene og at forresten er det ingen av sametingsrepresentantene som har mer samisk navn enn meg !

source: Áhkkun ja áddján
nob: Besteforeldre

source: – Mu bargu Redningsselskapas lea eanaš eastadeaddji bargu mánáid ja nuoraid gaskkas ovttasbarggus skuvllaiguin .
nob: – Jobben min i Redningsselskapet er mest å drive forebyggende arbeid blant barn og unge i samarbeid med skolene .

source: Mátkkoštan ollu skuvllaid gaskkas .
nob: Jeg reiser mye rundt .

source: Oahppit besset fitnat gádjunfatnasis , ja mii oahpahit meara birra ja mo galgá sihkkarastit iežas .
nob: Elevene får komme ombord på redningsskøyta , og vi underviser om sjøen og hvordan man skal sikre seg .

source: Dalle oainnán ahte ollu buolvvaidgaskasaš máhttosirdimis lea jávkame .
nob: Da ser jeg at mye av den overføringa av kunnskaper mellom generasjonene som var før er i ferd med å bli borte .

source: Mánáin ii leat seamma oktavuohta mearain go ovdal .
nob: Barna har ikke samme kontakt med sjøen som før .

source: Lei suorggahahtti oaidnit ahte vearas nugo Bearalvágis eai lean mánát leamaš fatnasis eai ge rukkus .
nob: Det var skremmende å se at i et fiskevær som Berlevåg hadde ungene ikke vært i båt og ikke gått på kaia .
